app/views/admin/sessions/new.html.erb

        <%= f.label :profil_id , "Profil de poste" %>
        <%= select("session", "profil_id", Profil.all.collect { |profil| [profil.title, profil.id] })%>
---
SELECT "profils".* FROM "profils"