app/controllers/admin/profils_controller.rb

  def index
    @profils = Profil.all
---
SELECT "profils".* FROM "profils"

  def edit
    @profil = Profil.find(params[:id])
---
SELECT "profils".* FROM "profils" WHERE "profils"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @profil = Profil.new params.require(:profil).permit(:title, :description)
    respond_to do |format|
      if @profil.save
---
INSERT INTO "profils" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 04 Feb 2014 17:57:34 UTC +00:00], ["description", "gère le forum"], ["title", "modérateur"], ["updated_at", Tue, 04 Feb 2014 17:57:34 UTC +00:00]]

  def update
    @profil = Profil.find(params[:id])
    respond_to do |format|
      if @profil.update params.require(:profil).permit(:title, :description)
---
SELECT "profils".* FROM "profils" WHERE "profils"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "profils" SET "description" = ?, "updated_at" = ? WHERE "profils"."id" = 3  [["description", "gère le forum de la communauté"], ["updated_at", Tue, 04 Feb 2014 18:06:16 UTC +00:00]]

  def destroy
    @profil = Profil.find params[:id]
    if @profil.sessions.empty?
      @profil.destroy!
---
SELECT "profils".* FROM "profils" WHERE "profils"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "profils" WHERE "profils"."id" = ?  [["id", 2]]