app/controllers/admin/users_controller.rb

  def create
    @user = User.new params.require(:user).permit(:login, :mail, :status)
    @user.pass = User.generate_random_password
    password = @user.pass # On récupère le password avant qu'il soit sécurisé, afin de pouvoir l'envoyer par mail
    flash[:success] = password # a retiré lors du déploiement
    @user.state = User::ACTIVATE

    if @user.save
---
INSERT INTO "users" ("created_at", "login", "mail", "pass", "state", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find params[:id]

    if  @user.update params.require(:user).permit(:login, :mail)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "users" SET "login" = ?, "updated_at" = ? WHERE "users"."id" = 10  [["login", "hiveship2"], ["updated_at", Sat, 01 Feb 2014 21:53:16 UTC +00:00]]

  def destroy
    @user = User.find params[:id]

    if @user.id != @me.id
      @user.destroy!
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 13]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 10]]

  def activate
    @user = User.find params[:id]

    if @user.id != @me.id
      if @user.state == User::DEACTIVATE
        @user.update_columns :state => User::ACTIVATE
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "users" SET "state" = 'active' WHERE "users"."id" = 10

  def deactivate
    @user = User.find params[:id]

    if @user.id != @me.id
      if @user.state == User::ACTIVATE
        @user.update_columns :state => User::DEACTIVATE
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "users" SET "state" = 'blocked' WHERE "users"."id" = 10

  def set_admin
    @user = User.find params[:id]

    if  @user.id != @me.id
      if @user.status == User::RECRUTEUR || @user.status == User::MANAGER
        @user.update_columns :status => User::ADMIN
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "users" SET "pass" = '1f688122359fae53002b8cb1bed82566de0b449a02d8c1137109aafc427df87c9d5e2113b8b907ca460022e1c3ef585f43e3d01bfe318520244867d10698393e' WHERE "users"."id" = 1