plassani/app/controllers/site_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = '' AND "users"."pass" = 'cf83e1357eefb8bdf1542850d66d8007d620e4050b5715dc83f4a921d36ce9ce47d0d13c5d85f2b0ff8318d2877eec2f63b931bd47417a81a538327af927da3e' ORDER BY "users"."id" ASC LIMIT 1
---
  def auth
    login = params[:login]
    password = params[:pass]
    @me = User.where(login: login[:login], pass: User.hash_password(password[:pass])).first!