plassani/app/controllers/users_controller.rb

  def show
    if @me.status == User::ADMIN
      @user = User.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @user = User.new params.require(:user).permit(:login, :mail, :status, :pass)
    @user.pass = User.generate_random_password
    @user.state = User::ACTIVATE
    UserMailer.welcome(@user).deliver
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "login", "mail", "pass", "state", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @user = User.find params[:id]
    if @user.id != @me.id
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

  def activate
    @user = User.find params[:user_id]
    if @user.id != @me.id
      if @user.state == User::DEACTIVATE
        @user.update_columns :state => User::ACTIVATE
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "state" = 'active' WHERE "users"."id" = 3

  def deactivate
    @user = User.find params[:user_id]
    if @user.id != @me.id
      if @user.state == User::ACTIVATE
        @user.update_columns :state => User::DEACTIVATE
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "state" = 'blocked' WHERE "users"."id" = 3

  def set_admin
    @user = User.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]