app/controllers/candidatures_controller.rb

  def index
    @candidatures = Candidature.all
---
SELECT "candidatures".* FROM "candidatures"