app/controllers/profils_controller.rb

SELECT "profils".* FROM "profils"
---
  def index
    @profils = Profil.all

INSERT INTO "profils" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 26 Jan 2014 15:37:14 UTC +00:00], ["description", "professionnel"], ["title", "pro"], ["updated_at", Sun, 26 Jan 2014 15:37:14 UTC +00:00]]
---
  def create
    @profil = Profil.new(profil_params)

    respond_to do |format|
      if @profil.save

SELECT "profils".* FROM "profils" WHERE "profils"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_profil
      @profil = Profil.find(params[:id])