app/controllers/site_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = 'foo' AND "users"."pass" = 'd82c4eb5261cb9c8aa9855edd67d1bd10482f41529858d925094d173fa662aa91ff39bc5b188615273484021dfb16fd8284cf684ccf0fc795be3aa2fc1e6c181' ORDER BY "users"."id" ASC LIMIT 1
---
  def auth
    login = params[:login]
    password = params[:pass]
    @me = User.where(login: login[:login], pass: User.hash_password(password[:pass])).first!