app/controllers/site_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_pass" = 'admin' ORDER BY "users"."id" ASC LIMIT 1
---
  def auth
    login = params[:login]
    password = params[:pass]
   @me = User.where(user_pass: login[:user_login], user_pass: User.hash_password(password[:user_pass])).first!