app/controllers/users_controller.rb

  def create
    @user = User.new params.require(:user).permit(:login, :mail, :status, :pass)
    @user.pass = User.generate_random_password
    @user.state = User::ACTIVATE
     UserMailer.welcome(@user).deliver
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "login", "mail", "pass", "state", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find params[:id]
    respond_to do |format|
      if  @user.update params.require(:user).permit(:user_login, :user_mail, :user_pass)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "users" SET "login" = ?, "pass" = ?, "updated_at" = ? WHERE "users"."id" = 10  [["login", "hiveship"], ["pass", "test"], ["updated_at", Sat, 25 Jan 2014 17:07:23 UTC +00:00]]

  def destroy
    @user = User.find params[:id]
    if @user.id != @me.id
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]

  def activate
    @user = User.find params[:user_id]
    if @user.id != @me.id
      if @user.state == User::DEACTIVATE
        @user.update_columns :state => User::ACTIVATE
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "users" SET "state" = 'active' WHERE "users"."id" = 3

  def deactivate
    @user = User.find params[:user_id]
    if @user.id != @me.id
      if @user.state == User::ACTIVATE
        @user.update_columns :state => User::DEACTIVATE
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "users" SET "state" = 'blocked' WHERE "users"."id" = 3

  def set_admin
    @user = User.find params[:id]
    if  @user.id != @me.id
      if @user.status == User::RECRUTEUR
        @user.update_columns :status => User::ADMIN
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "users" SET "pass" = '031c11e96185fcbb5d024eec88eff962ccd645c24a17f30bfc434bda416c410fd1f3b4dcb2394f7426a2e21525eea6611332ccd2a3144cde6408f105a1ed2ef7' WHERE "users"."id" = 3